""""""

"""
Задание 1 - easy

Напишите 3 варианта использования отправки уведомления в телеграм.

"""

"""
Задание 2 - medium

Напишите 3 идеи добавления модулей, которые можно добавить в скрипт для улучшения его функционала.

"""

"""
Задание 3 - hard

Напишите 3 идеи, как при помощи заготовки можно автоматизировать какую-то задачу в крипте и не только,
при помощи данной заготовке в формате:

Идея: Отслеживание балансов кошельков

Описание: Скрипт отслеживает раз в 5 минут балансы всех кошельков и отправляет уведомление в телеграм,
если баланс упал более чем на 50% за последние 5 минут.

Шаги которые выполняет скрипт:
1. Берет аккаунт, по которому проверка баланса была более 5 минут назад
2. Получает баланс кошелька
3. Сравнивает баланс с предыдущим балансом
4. Если баланс упал более чем на 50%, то отправляет уведомление в телеграм
5. Записывает время проверки баланса
6. Записывает новый баланс

Опубликуйте свои идеи в комментарии под уроком.

"""



