
"""
Возьмите файл requirements.txt из папки с домашним заданием.
Напишите коротко, зачем каждая библиотека нужна.
Напишите какую команду использовать для установки всех библиотек из файла requirements.txt.
Напишите какую команду использовать для отдельной установки каждой библиотеки из файла requirements.txt.
Проверьте каждую библиотеку, eсли что-то не в порядке, напишите об этом в решении.

loguru - библиотека для логирования
openpyxl - библиотека для работы с файлами Excel
playwright - библиотека для автоматизации браузеров
python-dotenv - библиотека для работы с переменными окружения
mm-okx - неизвестная библиотеке, возможен скам, опасно использовать
requests - библиотека для работы с HTTP-запросами
web3 - библиотека для работы с блокчейном

Установка всех библиотек из файла requirements.txt:
pip install -r requirements.txt

Установка каждой библиотеки из файла requirements.txt:
pip install loguru

Установка каждой библиотеки из файла requirements.txt с указанием версии:
pip install loguru==0.5.3


mm-okx - неизвестная библиотека, возможен скам, опасно использовать.
Притворяется библиотекой для работы с биржей OKX.
"""